[{"web-scraper-order":"1758564163-1","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/pTXJ2dtDuNd3xC_fmJmgVQ/60s.jpg","Totalreviews":"20 Coffee reviews","checkins":"2 check-ins","reviewtext":"Came back to give them another try. This time i was definitely impressed. The young lady working the register was friendly and welcoming. I was informed by the manager to come back and get my drink remade on the house. I showed the workers the message and my review, but they were unaware of what was going on. They quickly got on top of it and reached out to the owner for clarification and got me together. \r\n\r\nI ordered a honey Lavender Latte (iced). It was so delicious. It was not overly sweet and you can definitely taste both the honey and lavender. This may be my go to drink. \r\n\r\nI also ordered the breakfast Sammie. It's a breakfast sandwich with bacon, fried egg, cheese, and cinnamon butter on sourdough bread. They toasted the bread perfectly and sprinkled it with a touch of sea salt. I should've gotten a side of cinnamon butter or a little extra to incorporate a little more sweetness to balance out the salty. It was delicious and filling. \r\n\r\nThank you Rachel for ensuring my  next visit and drink was better than the first!","Reviewdate":"Sep 3, 2025","Location":"Saint Louis, MO","Name":"Erika H.","rating":"5 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-2","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/HNJ9IhsJ-2IPKJQjjreKjg/60s.jpg","Totalreviews":"29 Coffee reviews","checkins":"4 check-ins","reviewtext":"I f*cking love Coma Coffee. It is the perfect work from home / study / hangout spot. \r\n\r\nThe food is great and I'm glad they have such a robust menu. Their drinks are also fabulous and I've been working my way through their menu. I gotta say the lavender latte is a favorite. Definitely wanna go back and try their cold brew with the chocolate cold foam! \r\n\r\nI will say for remote workers it can get a little loud. So bring your noise canceling headphones and make sure your laptop / devices are charged cause they don't have a ton of outlets either. All that to say, the wifi is strong and I've never had issues with it.","Reviewdate":"Jul 28, 2025","Location":"Kirkwood, MO","Name":"Jade H.","rating":"5 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-3","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/zzk4u8_z-3_LepqjHBsssg/60s.jpg","Totalreviews":"17 Coffee reviews","checkins":"","reviewtext":"I stopped into Coma Coffee looking forward to trying something new and interesting--a strawberry matcha latte with a shot of espresso. Unfortunately, my experience from the moment I walked in was uncomfortable and disappointing.\r\n\r\nI was greeted at the register by a staff member who was dry and disinterested. I placed my order and sat near the bar to wait. While my drink was being made, I overheard two baristas talking about it. One barista began preparing the drink by adding strawberry syrup to the milk, while the other mixed the matcha and espresso together. Midway through, one said to the other, \"Why are you doing it like that? It makes the drink not as pretty.\"\r\n\r\nDespite this comment, they continued anyway and handed me the drink, fully aware it didn't look right. It ended up being an unappetizing brown-green color. That interaction alone made me feel like I was being handed something they weren't proud of. It felt careless and awkward--especially as a customer who paid for a specific, customized drink.\r\n\r\nFeeling uneasy about the whole thing, I went back to the register and explained what I saw and heard. Instead of an apology or any attempt to make it right, I got a half-hearted explanation about the \"buoyancy\" of espresso and matcha--something I know isn't the real issue. It felt dismissive and insincere, like they were brushing me off rather than addressing my concern.\r\n\r\nAt the end of the day, it's not just about how the drink looked (though it looked bad)--it's about how I was made to feel. If the staff openly criticize how a drink is being made in front of the customer and then serve it anyway, it sends the message that quality and customer experience don't matter. I left feeling unwelcome and disappointed. I won't be returning.","Reviewdate":"Jul 22, 2025","Location":"Saint Louis, MO","Name":"Amber F.","rating":"1 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-4","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/RQttmwY-P7mOlP4g_MZN0A/60s.jpg","Totalreviews":"49 Coffee reviews","checkins":"2 check-ins","reviewtext":"What an absolute gem in brentwood! In an area that is a desert for good coffee Coma can be your oasis. Multi level, vibey, and delicious. \r\n\r\nFirst and foremost the workers are awesome. Just a slew of coffee loving folks smiling and having a good time serving students, partners, professionals, and everyone in between. \r\n\r\nYou can study, catch up with friends, and even have yourself an AM espresso martini. Bar seating, table seating, stools. No matter the occasion they got you set. \r\n\r\nOh, and the pastry box is DECADENT! The confetti cookie is incredible.","Reviewdate":"Jul 7, 2025","Location":"Brentwood, MO","Name":"Austin S.","rating":"5 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-5","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/j2uKt7C-NUOL2tvxllR6fQ/60s.jpg","Totalreviews":"18 Brunch reviews","checkins":"","reviewtext":"I came in to test Coma out as a coffee shop to get some work done outside of my home office. Came in on a Friday late morning. Most of the tables downstairs were already taken but I lucked out and someone was leaving as I arrived. Didn't have a chance to peek upstairs but it seemed pretty busy. \r\n\r\nVariety of coffee beverages, including seasonal specials! I had a dirty turmeric latte  special which had good flavor but note that is comes iced by default. Appreciates the variety of breakfast and lunch options but will say that the prices are kind of high for what you get. Definitely recommend a biscuit though! Great texture and flavor!","Reviewdate":"Jun 10, 2025","Location":"Saint Louis, MO","Name":"Alex R.","rating":"4 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-6","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/hrpgmz3C5bjW-B7EgYRsqg/60s.jpg","Totalreviews":"3 Brunch reviews","checkins":"","reviewtext":"been to coma coffee a few times! wish that they still had their late hours rather than closing at 4pm. but the black bean burger i've had was delicious. i think my fave summer drink i've tried is a dirty strawberry matcha it was perfect balance between the espresso and the sweetness. their pesto focaccia is so good. and you will probs have great luck with any of the other bakery items.","Reviewdate":"Sep 20, 2025","Location":"Western 49-63, Kansas City, MO","Name":"Ria D.","rating":"5 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-7","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/ecWwxcZDnexKz31uHjZxeA/60s.jpg","Totalreviews":"","checkins":"","reviewtext":"This place is great for baked goods, meals, coffee, or cocktails. There is plenty of seating. Even though it is usually busy, I am able to focus and get a lot of work done without distractions. The staff is friendly. A bonus is that they have Prairie Artisan Rainbow Sherbet sour ale on tap!","Reviewdate":"Sep 21, 2025","Location":"Clayton, MO","Name":"Debra I.","rating":"4 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-8","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/6K-0tPekzWvuw7C7H3GpDg/60s.jpg","Totalreviews":"7 Coffee reviews","checkins":"","reviewtext":"I love Coma! The lighting, space, and customer service is always amazing. I've not had any food there I didn't like and it's a great place for me to get work done. I got the iced chai and chicken tacos and I loved them both.","Reviewdate":"Jul 13, 2025","Location":"Olivette, MO","Name":"Jaslynn W.","rating":"5 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-9","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/pmUe7jVyBQwMVuYJpNZxOA/60s.jpg","Totalreviews":"28 Coffee reviews","checkins":"","reviewtext":"Food: 4 Stars\r\nService:4 Stars\r\n\r\nI've been visiting this spot for years and love that when I'm in the area running errands, just shopping, or want to meet up with a friend for a quick chat I can turn to Coma for a moment to breathe/reset. The cafe isn't located in a spot that's easily visible from the main road, as it sits within a corporate/residential complex. I'm not sure what the parking is like during the week day, but on the evenings and weekends, the parking lot always has spots available. \r\n\r\nService can be a hit or a miss, but they do have cozy seating, free WiFi, counter charging, and an overall welcoming ambiance. We really enjoy their menu items, especially when seasonal items are in rotation. \r\n\r\nHighly recommend Coma and hope you enjoy your experience as much as I do!","Reviewdate":"Feb 9, 2025","Location":"Chesterfield, MO","Name":"Lynn A.","rating":"4 star rating","overallrating":"4 star rating"},{"web-scraper-order":"1758564163-10","web-scraper-start-url":"https://www.yelp.com/biz/coma-coffee-roasters-richmond-heights?osq=Coffee+Roasteries","image-src":"https://s3-media0.fl.yelpcdn.com/photo/hpPpresgk4fbz3m2whzDKA/60s.jpg","Totalreviews":"16 Coffee reviews","checkins":"","reviewtext":"There is more than one reason this place is packed every day of the week despite being in an unassuming spot at the bottom of an office building. The food is good, the coffee is great, and the natural lighting helps you feel not so bad about being inside working! I appreciate the all day options of both breakfast and lunch, the copious veggie options, and the creative lattes and cold brews. It is a little expensive but they are clearly making everything to order. That's why every time I have an errand in Brentwood, I bring my laptop along to get some work done in Coma's ambiance.","Reviewdate":"Jun 7, 2025","Location":"Saint Louis, MO","Name":"Devin B.","rating":"5 star rating","overallrating":"4 star rating"}]